# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих строках записаны N целых чисел Ai. Последняя строка содержит число X

# N = int(input("Количество элементов = " ))
# array = []
# for i in range(1, N):
#     array.append(i)
#     print(i)
# what = int(input("Какое число считаем?"))
# how_much = 0
# for i in array:
#     if i == what:
#         how_much += 1
# print(how_much)


# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

N = int(input("Количество элементов = " ))
array = []
for i in range(1, N):
    array.append(i)
    print(i)

X = int(input("К какому числу ищем ближайшее? "))

min = abs(X - array[0])

for i in array:
    count = abs(X - array[i])
    if count < min:
        min = count
        index = i

print(array[i])